# [Python Programming Foundation Course](https://practice.geeksforgeeks.org/courses/Python-Foundation?utm_source=geeksforgeeks&utm_medium=article&utm_campaign=GFG_Article_Bottom_Python_Foundation)

by GeeksForGeeks 


<a id='toc'></a>
## Table of Contents

<a id='toc1'></a>
1. [Pandas GroupBy](#section1)
1. [Combining multiple columns in Pandas groupby with dictionary](#section2)
1. [How to combine Groupby and Multiple Aggregate Functions in Pandas?](#section3)
1. [Pandas – Groupby multiple values and plotting results](#section4)
1. [Pandas – GroupBy One Column and Get Mean, Min, and Max values](#section5)
1. [Select row with maximum and minimum value in Pandas dataframe](#section6)
1. [Find maximum values & position in columns and rows of a Dataframe in Pandas](#section7)
1. [Python | Pandas dataframe.max()](#section8)
1. [Python | Pandas dataframe.idxmax()](#section9)
1. [Get the index of maximum value in DataFrame column](#section10)
1. [How to get rows/index names in Pandas dataframe](#section11)
1. [Decimal Functions in Python | Set 2 (logical_and(), normalize(), quantize(), rotate() … )](#section12)
1. [NetworkX : Python software package for study of complex networks](#section13)
1. [Directed Graphs, Multigraphs and Visualization in Networkx](#section14)
1. [Python | Visualize graphs generated in NetworkX using Matplotlib](#section15)
1. [Visualize Graphs in Python](#section16)
1. [Graph Plotting in Python | Set 1](#section17)
1. [Graph Plotting in Python | Set 2](#section18)
1. [Graph Plotting in Python | Set 3](#section19)
1. [Plotting graph using Seaborn | Python](#section20)
1. [Box plot visualization with Pandas and Seaborn](#section21)
1. [Box Plot in Python using Matplotlib](#section22)
1. [How to get column names in Pandas dataframe](#section23)
1. [Python | Pandas dataframe.groupby()](#section24)
1. [Adding new column to existing DataFrame in Pandas](#section25)
1. [Python map() function](#section26)
1. [Taking input in Python](#section27)
1. [Iterate over a list in Python](#section28)
1. [Python program to convert a list to string](#section29)

<a id='section1'></a>
## 1. [Pandas GroupBy](https://www.geeksforgeeks.org/pandas-groupby/?ref=lbp)

Groupby is a pretty simple concept. We can create a grouping of categories and apply a function to the categories. It’s a simple concept but it’s an extremely valuable technique that’s widely used in data science. In real data science projects, you’ll be dealing with large amounts of data and trying things over and over, so for efficiency, we use Groupby concept. Groupby concept is really important because it’s ability to aggregate data efficiently, both in performance and the amount code is magnificent. Groupby mainly refers to a process involving one or more of the following steps they are:

* Splitting : It is a process in which we split data into group by applying some conditions on datasets.
* Applying : It is a process in which we apply a function to each group independently
* Combining : It is a process in which we combine different datasets after applying groupby and results into a data structure

The following image will help in understanding a process involve in Groupby concept.
1. Group the unique values from the Team column <img src="https://media.geeksforgeeks.org/wp-content/uploads/groupby1.png" alt="" width="1000" height="484" class="alignnone size-full wp-image-873011">
1. Now there’s a bucket for each group <img src="https://media.geeksforgeeks.org/wp-content/uploads/groupby3.png" alt="" width="1000" height="717" class="alignnone size-full wp-image-873014">
1. Toss the other data into the buckets <img src="https://media.geeksforgeeks.org/wp-content/uploads/groupby2.png" alt="" width="1000" height="458" class="alignnone size-full wp-image-873013">
1.  Apply a function on the weight column of each bucket. <img src="https://media.geeksforgeeks.org/wp-content/uploads/groupby4.png" alt="" width="1000" height="779" class="alignnone size-full wp-image-873021">

### Splitting Data into Groups

Splitting is a process in which we split data into a group by applying some conditions on datasets. In order to split the data, we apply certain conditions on datasets. In order to split the data, we use `groupby()` function this function is used to split the data into groups based on some criteria. Pandas objects can be split on any of their axes. The abstract definition of grouping is to provide a mapping of labels to group names. Pandas datasets can be split into any of their objects. There are multiple ways to split data like:

* `obj.groupby(key)`
* `obj.groupby(key, axis=1)`
* `obj.groupby([key1, key2])`

**Note :** In this we refer to the grouping objects as the keys.

### Grouping data with one key:

In order to group data with one key, we pass only one key as an argument in groupby function.

In [12]:
# importing pandas module
import pandas as pd 
   
# Define a dictionary containing employee data 
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi', 
                 'Gaurav', 'Anuj', 'Princi', 'Abhi'], 
        'Age':[27, 24, 22, 32, 
               33, 36, 27, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj',
                   'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd',
                         'B.Tech', 'B.com', 'Msc', 'MA']} 
     
   
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1)
   
print(df)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1    Anuj   24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3  Princi   32    Kannuaj           Phd
4  Gaurav   33    Jaunpur        B.Tech
5    Anuj   36     Kanpur         B.com
6  Princi   27  Allahabad           Msc
7    Abhi   32    Aligarh            MA

Now we group a data of `Name` using `groupby()` function.

In [15]:
# using groupby function
# with one key
  
df.groupby('Name')
print(df.groupby('Name').groups)

{'Abhi': [7], 'Anuj': [1, 5], 'Gaurav': [4], 'Jai': [0, 2], 'Princi': [3, 6]}

**Output :**

<img src="https://media.geeksforgeeks.org/wp-content/uploads/ser23.jpg" alt="" width="982" height="41" class="alignnone size-full wp-image-840328">

Now we print the first entries in all the groups formed.

In [16]:
# applying groupby() function to 
# group the data on Name value. 
gk = df.groupby('Name') 
    
# Let's print the first entries 
# in all the groups formed. 
gk.first()

        Age  Address Qualification
Name
Abhi     32  Aligarh            MA
Anuj     24   Kanpur            MA
Gaurav   33  Jaunpur        B.Tech
Jai      27   Nagpur           Msc
Princi   32  Kannuaj           Phd

### Grouping data with multiple keys :

In order to group data with multiple keys, we pass multiple keys in `groupby` function.

In [8]:
# importing pandas module
import pandas as pd 
   
# Define a dictionary containing employee data 
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi', 
                 'Gaurav', 'Anuj', 'Princi', 'Abhi'], 
        'Age':[27, 24, 22, 32, 
               33, 36, 27, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj',
                   'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd',
                         'B.Tech', 'B.com', 'Msc', 'MA']} 
     
   
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1)
   
print(df)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1    Anuj   24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3  Princi   32    Kannuaj           Phd
4  Gaurav   33    Jaunpur        B.Tech
5    Anuj   36     Kanpur         B.com
6  Princi   27  Allahabad           Msc
7    Abhi   32    Aligarh            MA

Now we group a data of “Name” and “Qualification” together using multiple keys in groupby function.

In [11]:
# Using multiple keys in
# groupby() function
df.groupby(['Name', 'Qualification'])

print(df.groupby(['Name', 'Qualification']).groups)

{('Abhi', 'MA'): [7], ('Anuj', 'B.com'): [5], ('Anuj', 'MA'): [1], ('Gaurav', 'B.Tech'): [4], ('Jai', 'MCA'): [2], ('Jai', 'Msc'): [0], ('Princi', 'Msc'): [6], ('Princi', 'Phd'): [3]}

### Grouping data by sorting keys :

Group keys are sorted by default uring the groupby operation. User can pass `sort=False` for potential speedups.

In [2]:
# importing pandas module
import pandas as pd 

# Define a dictionary containing employee data 
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi', 
                 'Gaurav', 'Anuj', 'Princi', 'Abhi'], 
        'Age':[27, 24, 22, 32, 
               33, 36, 27, 32], } 


# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1)

print(df)

     Name  Age
0     Jai   27
1    Anuj   24
2     Jai   22
3  Princi   32
4  Gaurav   33
5    Anuj   36
6  Princi   27
7    Abhi   32

Now we apply `groupby()` without `sort`

In [3]:
# using groupby function
# without using sort
  
df.groupby(['Name']).sum()

        Age
Name
Abhi     32
Anuj     60
Gaurav   33
Jai      49
Princi   59

Now we apply `groupby()` using sort in order to attain potential speedups

In [6]:
# using groupby function
# with sort
  
df.groupby(['Name'], sort = False).sum()

        Age
Name
Jai      49
Anuj     60
Princi   59
Gaurav   33
Abhi     32

### Grouping data with object attributes :

Groups attribute is like dictionary whose keys are the computed unique groups and corresponding values being the axis labels belonging to each group.

In [17]:
# importing pandas module
import pandas as pd 
   
# Define a dictionary containing employee data 
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi', 
                 'Gaurav', 'Anuj', 'Princi', 'Abhi'], 
        'Age':[27, 24, 22, 32, 
               33, 36, 27, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj',
                   'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd',
                         'B.Tech', 'B.com', 'Msc', 'MA']} 
     
   
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1)
   
print(df)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1    Anuj   24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3  Princi   32    Kannuaj           Phd
4  Gaurav   33    Jaunpur        B.Tech
5    Anuj   36     Kanpur         B.com
6  Princi   27  Allahabad           Msc
7    Abhi   32    Aligarh            MA

Now we group data like we do in a dictionary using keys.

In [18]:
# using keys for grouping
# data
  
df.groupby('Name').groups

{'Abhi': [7], 'Anuj': [1, 5], 'Gaurav': [4], 'Jai': [0, 2], 'Princi': [3, 6]}

### Iterating through groups

In order to iterate an element of groups, we can iterate through the object similar to `itertools.obj`.

In [19]:
# importing pandas module
import pandas as pd 
   
# Define a dictionary containing employee data 
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi', 
                 'Gaurav', 'Anuj', 'Princi', 'Abhi'], 
        'Age':[27, 24, 22, 32, 
               33, 36, 27, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj',
                   'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd',
                         'B.Tech', 'B.com', 'Msc', 'MA']} 
     
   
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1)
   
print(df)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1    Anuj   24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3  Princi   32    Kannuaj           Phd
4  Gaurav   33    Jaunpur        B.Tech
5    Anuj   36     Kanpur         B.com
6  Princi   27  Allahabad           Msc
7    Abhi   32    Aligarh            MA

Now we iterate an element of group in a similar way we do in itertools.obj.

In [20]:
# iterating an element
# of group
  
grp = df.groupby('Name')
for name, group in grp:
    print(name)
    print(group)
    print()

Abhi
   Name  Age  Address Qualification
7  Abhi   32  Aligarh            MA

Anuj
   Name  Age Address Qualification
1  Anuj   24  Kanpur            MA
5  Anuj   36  Kanpur         B.com

Gaurav
     Name  Age  Address Qualification
4  Gaurav   33  Jaunpur        B.Tech

Jai
  Name  Age    Address Qualification
0  Jai   27     Nagpur           Msc
2  Jai   22  Allahabad           MCA

Princi
     Name  Age    Address Qualification
3  Princi   32    Kannuaj           Phd
6  Princi   27  Allahabad           Msc

Now we iterate an element of group containing multiple keys

In [22]:
# iterating an element
# of group containing 
# multiple keys
  
grp = df.groupby(['Name', 'Qualification'])
for name, group in grp:
    print(name)
    print(group)
    print()

('Abhi', 'MA')
   Name  Age  Address Qualification
7  Abhi   32  Aligarh            MA

('Anuj', 'B.com')
   Name  Age Address Qualification
5  Anuj   36  Kanpur         B.com

('Anuj', 'MA')
   Name  Age Address Qualification
1  Anuj   24  Kanpur            MA

('Gaurav', 'B.Tech')
     Name  Age  Address Qualification
4  Gaurav   33  Jaunpur        B.Tech

('Jai', 'MCA')
  Name  Age    Address Qualification
2  Jai   22  Allahabad           MCA

('Jai', 'Msc')
  Name  Age Address Qualification
0  Jai   27  Nagpur           Msc

('Princi', 'Msc')
     Name  Age    Address Qualification
6  Princi   27  Allahabad           Msc

('Princi', 'Phd')
     Name  Age  Address Qualification
3  Princi   32  Kannuaj           Phd

### Selecting a groups

In order to select a group, we can select group using `GroupBy.get_group()`. We can select a group by applying a function `GroupBy.get_group` this function select a single group.

In [23]:
# importing pandas module
import pandas as pd 
   
# Define a dictionary containing employee data 
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi', 
                 'Gaurav', 'Anuj', 'Princi', 'Abhi'], 
        'Age':[27, 24, 22, 32, 
               33, 36, 27, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj',
                   'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd',
                         'B.Tech', 'B.com', 'Msc', 'MA']} 
     
   
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1)
   
print(df)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1    Anuj   24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3  Princi   32    Kannuaj           Phd
4  Gaurav   33    Jaunpur        B.Tech
5    Anuj   36     Kanpur         B.com
6  Princi   27  Allahabad           Msc
7    Abhi   32    Aligarh            MA

Now we select a single group using `Groupby.get_group`.

In [24]:
# selecting a single group
  
grp = df.groupby('Name')
grp.get_group('Jai')

  Name  Age    Address Qualification
0  Jai   27     Nagpur           Msc
2  Jai   22  Allahabad           MCA

Now we select an object grouped on multiple columns

In [25]:
# selecting object grouped
# on multiple columns
  
grp = df.groupby(['Name', 'Qualification'])
grp.get_group(('Jai', 'Msc'))

  Name  Age Address Qualification
0  Jai   27  Nagpur           Msc

### Applying function to group

After splitting a data into a group, we apply a function to each group in order to do that we perform some operation they are:

* **Aggregation :** It is a process in which we compute a summary statistic (or statistics) about each group. For Example, Compute group sums ormeans
* **Transformation :** It is a process in which we perform some group-specific computations and return a like-indexed. For Example, Filling NAs within groups with a value derived from each group
* **Filtration :** It is a process in which we discard some groups, according to a group-wise computation that evaluates True or False. For Example, Filtering out data based on the group sum or mean

**Aggregation :**

Aggregation is a process in which we compute a summary statistic about each group. Aggregated function returns a single aggregated value for each group. After splitting a data into groups using `groupby` function, several aggregation operations can be performed on the grouped data.

**Code #1:** Using aggregation via the aggregate method

In [26]:
# importing pandas module
import pandas as pd 
  
# importing numpy as np
import numpy as np
   
# Define a dictionary containing employee data 
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi', 
                 'Gaurav', 'Anuj', 'Princi', 'Abhi'], 
        'Age':[27, 24, 22, 32, 
               33, 36, 27, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj',
                   'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd',
                         'B.Tech', 'B.com', 'Msc', 'MA']} 
     
   
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1)
   
print(df)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1    Anuj   24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3  Princi   32    Kannuaj           Phd
4  Gaurav   33    Jaunpur        B.Tech
5    Anuj   36     Kanpur         B.com
6  Princi   27  Allahabad           Msc
7    Abhi   32    Aligarh            MA

Now we perform aggregation using aggregate method

In [27]:
# performing aggregation using
# aggregate method
  
grp1 = df.groupby('Name')
  
grp1.aggregate(np.sum)

        Age
Name
Abhi     32
Anuj     60
Gaurav   33
Jai      49
Princi   59

Now we perform aggregation on agroup containing multiple keys

In [28]:
# performing aggregation on
# group containing multiple
# keys
grp1 = df.groupby(['Name', 'Qualification'])
  
grp1.aggregate(np.sum)

                      Age
Name   Qualification
Abhi   MA              32
Anuj   B.com           36
       MA              24
Gaurav B.Tech          33
Jai    MCA             22
       Msc             27
Princi Msc             27
       Phd             32

### Applying multiple functions at once :

We can apply a multiple functions at once by passing a list or dictionary of functions to do aggregation with, outputting a DataFrame.

In [29]:

# importing pandas module
import pandas as pd 
  
# importing numpy as np
import numpy as np
   
# Define a dictionary containing employee data 
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi', 
                 'Gaurav', 'Anuj', 'Princi', 'Abhi'], 
        'Age':[27, 24, 22, 32, 
               33, 36, 27, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj',
                   'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd',
                         'B.Tech', 'B.com', 'Msc', 'MA']} 
     
   
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1)
   
print(df)

     Name  Age    Address Qualification
0     Jai   27     Nagpur           Msc
1    Anuj   24     Kanpur            MA
2     Jai   22  Allahabad           MCA
3  Princi   32    Kannuaj           Phd
4  Gaurav   33    Jaunpur        B.Tech
5    Anuj   36     Kanpur         B.com
6  Princi   27  Allahabad           Msc
7    Abhi   32    Aligarh            MA

Now we apply a multiple functions by passing a list of functions.

In [30]:
# applying a function by passing
# a list of functions
  
grp = df.groupby('Name')
  
grp['Age'].agg([np.sum, np.mean, np.std])

        sum  mean       std
Name
Abhi     32  32.0       NaN
Anuj     60  30.0  8.485281
Gaurav   33  33.0       NaN
Jai      49  24.5  3.535534
Princi   59  29.5  3.535534

### Applying different functions to DataFrame columns :

In order to apply a different aggregation to the columns of a DataFrame, we can pass a dictionary to aggregate .

In [31]:
# importing pandas module
import pandas as pd 
  
# importing numpy as np
import numpy as np
   
# Define a dictionary containing employee data 
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi', 
                 'Gaurav', 'Anuj', 'Princi', 'Abhi'], 
        'Age':[27, 24, 22, 32, 
               33, 36, 27, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj',
                   'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd',
                         'B.Tech', 'B.com', 'Msc', 'MA'],
        'Score': [23, 34, 35, 45, 47, 50, 52, 53]} 
     
   
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1)
   
print(df)

     Name  Age    Address Qualification  Score
0     Jai   27     Nagpur           Msc     23
1    Anuj   24     Kanpur            MA     34
2     Jai   22  Allahabad           MCA     35
3  Princi   32    Kannuaj           Phd     45
4  Gaurav   33    Jaunpur        B.Tech     47
5    Anuj   36     Kanpur         B.com     50
6  Princi   27  Allahabad           Msc     52
7    Abhi   32    Aligarh            MA     53

Now we apply a different aggregation to the columns of a dataframe.

In [32]:
# using different aggregation
# function by passing dictionary
# to aggregate
grp = df.groupby('Name')
  
grp.agg({'Age' : 'sum', 'Score' : 'std'})

        Age      Score
Name
Abhi     32        NaN
Anuj     60  11.313708
Gaurav   33        NaN
Jai      49   8.485281
Princi   59   4.949747

### Transformation :

Transformation is a process in which we perform some group-specific computations and return a like-indexed. Transform method returns an object that is indexed the same (same size) as the one being grouped. The transform function must:

* Return a result that is either the same size as the group chunk
* Operate column-by-column on the group chunk
* Not perform in-place operations on the group chunk.

In [33]:

# importing pandas module
import pandas as pd 
  
# importing numpy as np
import numpy as np
   
# Define a dictionary containing employee data 
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi', 
                 'Gaurav', 'Anuj', 'Princi', 'Abhi'], 
        'Age':[27, 24, 22, 32, 
               33, 36, 27, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj',
                   'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd',
                         'B.Tech', 'B.com', 'Msc', 'MA'],
        'Score': [23, 34, 35, 45, 47, 50, 52, 53]} 
     
   
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1)
   
print(df)

     Name  Age    Address Qualification  Score
0     Jai   27     Nagpur           Msc     23
1    Anuj   24     Kanpur            MA     34
2     Jai   22  Allahabad           MCA     35
3  Princi   32    Kannuaj           Phd     45
4  Gaurav   33    Jaunpur        B.Tech     47
5    Anuj   36     Kanpur         B.com     50
6  Princi   27  Allahabad           Msc     52
7    Abhi   32    Aligarh            MA     53

Now we perform some group-specific computations and return a like-indexed.

In [34]:
## using transform function
grp = df.groupby('Name')
sc = lambda x: (x - x.mean()) / x.std()*10
grp.transform(sc)

        Age     Score
0  7.071068 -7.071068
1 -7.071068 -7.071068
2 -7.071068  7.071068
3  7.071068 -7.071068
4       NaN       NaN
5  7.071068  7.071068
6 -7.071068  7.071068
7       NaN       NaN

### Filtration :

Filtration is a process in which we discard some groups, according to a group-wise computation that evaluates `True` or `False`. In order to filter a group, we use filter method and apply some condition by which we filter group.

In [35]:
# importing pandas module
import pandas as pd 
  
# importing numpy as np
import numpy as np
   
# Define a dictionary containing employee data 
data1 = {'Name':['Jai', 'Anuj', 'Jai', 'Princi', 
                 'Gaurav', 'Anuj', 'Princi', 'Abhi'], 
        'Age':[27, 24, 22, 32, 
               33, 36, 27, 32], 
        'Address':['Nagpur', 'Kanpur', 'Allahabad', 'Kannuaj',
                   'Jaunpur', 'Kanpur', 'Allahabad', 'Aligarh'], 
        'Qualification':['Msc', 'MA', 'MCA', 'Phd',
                         'B.Tech', 'B.com', 'Msc', 'MA'],
        'Score': [23, 34, 35, 45, 47, 50, 52, 53]} 
     
   
# Convert the dictionary into DataFrame  
df = pd.DataFrame(data1)
   
print(df)

     Name  Age    Address Qualification  Score
0     Jai   27     Nagpur           Msc     23
1    Anuj   24     Kanpur            MA     34
2     Jai   22  Allahabad           MCA     35
3  Princi   32    Kannuaj           Phd     45
4  Gaurav   33    Jaunpur        B.Tech     47
5    Anuj   36     Kanpur         B.com     50
6  Princi   27  Allahabad           Msc     52
7    Abhi   32    Aligarh            MA     53

Now we filter data that to return the Name which have lived two or more times .

In [37]:
# filtering data using
# filter data
grp = df.groupby('Name')
grp.filter(lambda x: len(x) >= 2)

     Name  Age    Address Qualification  Score
0     Jai   27     Nagpur           Msc     23
1    Anuj   24     Kanpur            MA     34
2     Jai   22  Allahabad           MCA     35
3  Princi   32    Kannuaj           Phd     45
5    Anuj   36     Kanpur         B.com     50
6  Princi   27  Allahabad           Msc     52

<a id='section2'></a>
## 2. [Combining multiple columns in Pandas groupby with dictionary](https://www.geeksforgeeks.org/combining-multiple-columns-in-pandas-groupby-with-dictionary/?ref=lbp)

<a id='section3'></a>
## 3. [How to combine Groupby and Multiple Aggregate Functions in Pandas?](https://www.geeksforgeeks.org/how-to-combine-groupby-and-multiple-aggregate-functions-in-pandas/?ref=lbp)

<a id='section4'></a>
## 4. [Pandas – Groupby multiple values and plotting results](https://www.geeksforgeeks.org/pandas-groupby-multiple-values-and-plotting-results/?ref=lbp)

<a id='section5'></a>
## 5. [Pandas – GroupBy One Column and Get Mean, Min, and Max values](https://www.geeksforgeeks.org/pandas-groupby-one-column-and-get-mean-min-and-max-values/?ref=lbp)

<a id='section6'></a>
## 6. [Select row with maximum and minimum value in Pandas dataframe](https://www.geeksforgeeks.org/select-row-with-maximum-and-minimum-value-in-pandas-dataframe/?ref=lbp)

<a id='section7'></a>
## 7. [Find maximum values & position in columns and rows of a Dataframe in Pandas](https://www.geeksforgeeks.org/find-maximum-values-position-in-columns-and-rows-of-a-dataframe-in-pandas/)

In this article, we are going to discuss how to find maximum value and its index position in columns and rows of a Dataframe.

**DataFrame.max()**

Pandas `dataframe.max()` method finds the maximum of the values in the object and returns it. If the input is a series, the method will return a scalar which will be the maximum of the values in the series. If the input is a dataframe, then the method will return a series with maximum of values over the specified axis in the dataframe. The index axis is the default axis taken by this method.

| **Syntax:** | `DataFrame.max(axis=None, skipna=None, level=None, numeric_only=None, **kwargs)`  |
| --- | --- |
| **Parameters :** | |
| **axis :** | { index (0), columns (1) }  |
| **skipna :** | Exclude NA/null values when computing the result  |
| **level :** | If the axis is a MultiIndex (hierarchical), count along a particular level, collapsing into a Series  |
| **numeric_only :** | Include only float, int, boolean columns. If None, will attempt to use everything, then use only numeric data. Not implemented for Series. |
| **Returns :** | max : Series or DataFrame (if level specified) |


Let’s take an example of how to use this function. Let’s suppose we have a Dataframe

In [38]:
import numpy as np
import pandas as pd

# List of Tuples
matrix = [(10, 56, 17),
          (np.NaN, 23, 11),
          (49, 36, 55),
          (75, np.NaN, 34),
          (89, 21, 44)
          ]

# Create a DataFrame
abc = pd.DataFrame(matrix, index = list('abcde'), columns = list('xyz'))
 
# output
abc

      x     y   z
a  10.0  56.0  17
b   NaN  23.0  11
c  49.0  36.0  55
d  75.0   NaN  34
e  89.0  21.0  44

### How to find Maximum values of every column?

To find the maximum value of each column, call max() method on the Dataframe object without taking any argument.

In [39]:
# find the maximum of each column
maxValues = abc.max()
 
print(maxValues)

x    89.0
y    56.0
z    55.0
dtype: float64

We can see that it returned a series of maximum values where the index is column name and values are the maxima from each column.

### How to find maximum values of every row?

To find the maximum value of each row, call max() method on the Dataframe object with an argument axis = 1.

In [40]:
# find the maximum values of each row
maxValues = abc.max(axis = 1)
print(maxValues)

a    56.0
b    23.0
c    55.0
d    75.0
e    89.0
dtype: float64

We can see that it returned a series of maximum values where the index is row name and values are the maxima from each row. We can see that in the above examples NaN values are skipped while finding the maximum values in any axis. We can include NaN values as well if we want.

###  How to find maximum values of every column without skipping NaN?

In [41]:
# find maximum value of each
# column without skipping NaN
maxValues = abc.max(skipna = False)
 
print(maxValues)

x     NaN
y     NaN
z    55.0
dtype: float64

By putting skipna=False we can include NaN values also. If any NaN value exists it will be considered as the maximum value.

### How to find maximum values of a single column or selected columns?

To get the maximum value of a single column see the following example

In [42]:
# find maximum value of a
# single column 'x'
maxClm = abc['x'].max()
 
print("Maximum value in column 'x': " )
print(maxClm)

Maximum value in column 'x':
89.0

We have another way to find maximum value of a column :

In [43]:
# find maximum value of a
# single column 'x'
maxClm = abc.max()['x']
maxClm

89.0

The result will be same as above.

A list of columns can also be passed instead of a single column to find the maximum values of specified columns

In [44]:
maxValues = abc[['x', 'z']].max()
 
print("Maximum value in column 'x' & 'z': ")
print(maxValues)

Maximum value in column 'x' & 'z':
x    89.0
z    55.0
dtype: float64

### How to get position of maximum values of every column?

**DataFrame.idxmax()**: Pandas **dataframe.idxmax()** method returns index of first occurrence of maximum over requested axis. While finding the index of the maximum value across any index, all NA/null values are excluded. 

| Syntax | DataFrame.idxmax(axis=0, skipna=True) |
| --- | --- |
| **Parameters :** |  |
| **axis :** | **0** or `‘index’` for **row-wise**, **1** or `‘columns’` for **column-wise**  |
| **skipna :** | Exclude NA/null values. If an entire row/column is NA, the result will be NA |
| **Returns :** | idxmax : Series |
 

Let’s take some examples to understand how to use it :

### How to get row index label of Maximum value in every column

In [45]:
# find the index position of maximum
# values in every column
maxValueIndex = abc.idxmax()
 
print("Maximum values of columns are at row index position :")
print(maxValueIndex)

Maximum values of columns are at row index position :
x    e
y    a
z    c
dtype: object

It returns a series containing the column names as index and row as index labels where the maximum value exists in that column.

### How to find Column names of Maximum value in every row?

In [46]:
# find the column name of maximum
# values in every row
maxValueIndex = abc.idxmax(axis = 1)
 
print("Max values of row are at following columns :")
print(maxValueIndex)

Max values of row are at following columns :
a    y
b    y
c    z
d    x
e    x
dtype: object

It returns a series containing the rows index labels as index and column names as values where the maximum value exists in that row.

<a id='section8'></a>
## 8. [Python | Pandas dataframe.max()](https://www.geeksforgeeks.org/python-pandas-dataframe-max/?ref=lbp)

<a id='section9'></a>
## 9. [Python | Pandas dataframe.idxmax()](https://www.geeksforgeeks.org/python-pandas-dataframe-idxmax/?ref=lbp)

<a id='section10'></a>
## 10. [Get the index of maximum value in DataFrame column](https://www.geeksforgeeks.org/get-the-index-of-maximum-value-in-dataframe-column/?ref=lbp)

<a id='section11'></a>
## 11. [How to get rows/index names in Pandas dataframe](https://www.geeksforgeeks.org/how-to-get-rows-index-names-in-pandas-dataframe/?ref=lbp)

<a id='section12'></a>
## 12. [Decimal Functions in Python | Set 2 (logical_and(), normalize(), quantize(), rotate() … )](https://www.geeksforgeeks.org/decimal-functions-in-python-set-2-logical_and-normalize-quantize-rotate/?ref=lbp)

<a id='section13'></a>
## 13. [NetworkX : Python software package for study of complex networks](https://www.geeksforgeeks.org/networkx-python-software-package-study-complex-networks/?ref=lbp)

<a id='section14'></a>
## 14. [Directed Graphs, Multigraphs and Visualization in Networkx](https://www.geeksforgeeks.org/directed-graphs-multigraphs-and-visualization-in-networkx/?ref=lbp)

<a id='section15'></a>
## 15. [Python | Visualize graphs generated in NetworkX using Matplotlib](https://www.geeksforgeeks.org/python-visualize-graphs-generated-in-networkx-using-matplotlib/?ref=lbp)

<a id='section16'></a>
## 16. [Visualize Graphs in Python](https://www.geeksforgeeks.org/visualize-graphs-in-python/?ref=lbp)

<a id='section17'></a>
## 17. [Graph Plotting in Python | Set 1](https://www.geeksforgeeks.org/graph-plotting-in-python-set-1/?ref=lbp)

<a id='section18'></a>
## 18. [Graph Plotting in Python | Set 2](https://www.geeksforgeeks.org/graph-plotting-python-set-2/?ref=lbp)

<a id='section19'></a>
## 19. [Graph Plotting in Python | Set 3](https://www.geeksforgeeks.org/graph-plotting-python-set-3/?ref=lbp)

<a id='section20'></a>
## 20. [Plotting graph using Seaborn | Python](https://www.geeksforgeeks.org/plotting-graph-using-seaborn-python/?ref=lbp)

<a id='section21'></a>
## 21. [Box plot visualization with Pandas and Seaborn](https://www.geeksforgeeks.org/box-plot-visualization-with-pandas-and-seaborn/?ref=lbp)

<a id='section22'></a>
## 22. [Box Plot in Python using Matplotlib](https://www.geeksforgeeks.org/box-plot-in-python-using-matplotlib/?ref=lbp)

<a id='section23'></a>
## 23. [How to get column names in Pandas dataframe](https://www.geeksforgeeks.org/how-to-get-column-names-in-pandas-dataframe/?ref=lbp)

<a id='section24'></a>
## 24. [Python | Pandas dataframe.groupby()](https://www.geeksforgeeks.org/python-pandas-dataframe-groupby/?ref=lbp)

<a id='section25'></a>
## 25. [Adding new column to existing DataFrame in Pandas](https://www.geeksforgeeks.org/adding-new-column-to-existing-dataframe-in-pandas/?ref=leftbar-rightbar)

<a id='section26'></a>
## 26. [Python map() function](https://www.geeksforgeeks.org/python-map-function/?ref=leftbar-rightbar)

<a id='section27'></a>
## 27. [Taking input in Python](https://www.geeksforgeeks.org/taking-input-in-python/?ref=leftbar-rightbar)

<a id='section28'></a>
## 28. [Iterate over a list in Python](https://www.geeksforgeeks.org/iterate-over-a-list-in-python/?ref=leftbar-rightbar)

<a id='section29'></a>
## 29. [Python program to convert a list to string](https://www.geeksforgeeks.org/python-program-to-convert-a-list-to-string/?ref=leftbar-rightbar)